app/Views/Front/catalogo_view.php

                $productosModel = new \App\Models\Producto_model();

                // Obtener los productos utilizando la instancia del modelo
                $productos = $productosModel->findAll();
---
SELECT *
FROM `productos`