app/Controllers/Catalogo_controller.php

SELECT *
FROM `productos`
WHERE `eliminado` = 'NO'
SELECT *
FROM `categorias`
ORDER BY `id` DESC
---
    public function index()
    {
        $productoModel = new Producto_model();
        $data['productos'] = $productoModel->where('eliminado', 'NO')->findAll();

        $categoriaModel = new categoria_model();
        $data['categorias'] = $categoriaModel->orderBy('id', 'DESC')->findAll();