app/Controllers/Producto_controller.php

    public function index()
    {
        $productoModel = new producto_model();
        $categoriaModel = new categoria_model();

        $data['productos'] = $productoModel->orderBy('id', 'DESC')->findAll();
        $data['categorias'] = $categoriaModel->orderBy('id', 'DESC')->findAll();
---
SELECT *
FROM `productos`
ORDER BY `id` DESC
SELECT *
FROM `categorias`
ORDER BY `id` DESC

    public function creaproducto(){

      $categoriasmodel = new categoria_model();
      // traer todas las categorias desde la db
      $data['categorias'] = $categoriasmodel->getCategorias();

      $productoModel = new producto_model();
      $data['obj'] = $productoModel->orderBy('id', 'DESC')->findAll();
---
SELECT *
FROM `productos`
ORDER BY `id` DESC

    public function singleproducto($id = null){

        $productoModel = new producto_model();
        $data['old'] = $productoModel->where('id', $id)->first();
---
SELECT *
FROM `productos`
WHERE `id` = '2'
 LIMIT 1

      public function eliminados()
      {

          $productoModel = new producto_model();
          $data['productos'] = $productoModel->orderBy('id', 'DESC')->findAll();
---
SELECT *
FROM `productos`
ORDER BY `id` DESC