app/Controllers/Usuario_crud_controller.php

    public function index(){
        $userModel = new usuarios_model();
        $perfilModel = new perfil_model();
        $data['usuarios'] = $userModel->orderBy('id', 'DESC')->findAll();
---
SELECT *
FROM `usuarios`
ORDER BY `id` DESC