app/Controllers/Ventas_controller.php

    public function ventas(){
        $session = session();
        $id=$session->get('id');
        $perfil=$session->get('perfil_id');
        if($perfil == '1'){
            $detalle_ventas = new Ventas_cabecera_model();
            $data['ventaDetalle'] = $detalle_ventas ->orderBy('id','DESC')->findall();
            $usuarios_model = new usuarios_model();
            $data['usuarios'] = $usuarios_model->orderBy('id', 'DESC')->findAll();
---
SELECT *
FROM `usuarios`
ORDER BY `id` DESC

public function comprar_carrito()
{
    $cart = \Config\Services::cart();
    $productos = $cart->contents();
    $request = \Config\Services::request();
    $montoTotal = 0;

    foreach ($productos as $producto) {
        $montoTotal += $producto["price"] * $producto["qty"];
    }

    $ventaCabecera = new Ventas_cabecera_model();
    $id_session=intval(session()->id);

    $fechaActual = date('Y-m-d H:i:s'); // Obtener la fecha actual en el formato deseado

    $idcabecera = $ventaCabecera->insert([
        "total_venta" => $montoTotal,
        "usuario_id" => $id_session,
        "fecha" => $fechaActual // Agregar la fecha actual al array de datos
    ]);
    $ventaDetalle = new Ventas_detalle_model();
    $productModel = new producto_model();

    foreach ($productos as $producto) {
        $ventaDetalle->insert([
            "venta_id" => $idcabecera,
            "producto_id" => $producto['id'],
            "cantidad" => $producto["qty"],
            "precio" => $producto["price"]
        ]);
---
INSERT INTO `ventas_cabecera` (`total_venta`, `usuario_id`, `fecha`) VALUES (800, 25, '2023-06-26 02:51:15')
INSERT INTO `venta_detalle` (`venta_id`, `producto_id`, `cantidad`, `precio`) VALUES (15, '11', 1, 800)

            // Restar la cantidad del carrito al stock actual
            $newStock = $stock - $producto["qty"];

        $productModel->update($producto["id"], ['stock' => $newStock]);
---
UPDATE `productos` SET `stock` = 6
WHERE `productos`.`id` IN ('11')